---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CeilingHasThicknessParam
source: html/a5b35b32-3177-7cf5-7237-0e956994d7b9.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CeilingHasThicknessParam Property

"Has Thickness"

## Syntax (C#)
```csharp
public static ForgeTypeId CeilingHasThicknessParam { get; }
```